SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy7.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy7.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy7.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy7.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy7.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy7.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy7.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy7.menu.bodmode.disabled=Disabled/Disabled
atxy7.menu.bodmode.enabled=Enabled/Enabled
atxy7.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy7.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy7.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy7.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy7.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy7.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy7.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy7.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy7.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy7.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
atxy7.menu.eesave.enable=EEPROM retained
atxy7.menu.eesave.enable.bootloader.eesavebit=1
atxy7.menu.eesave.disable=EEPROM not retained
atxy7.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy7.menu.millis.enabled=Enabled (default timer)
atxy7.menu.millis.disabled=Disabled (saves flash)
atxy7.menu.millis.timera=TCA0 (default on 0-series)
atxy7.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
atxy7.menu.millis.rtc=RTC (no micros)
atxy7.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy7.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy7.menu.millis.disabled.build.millistimer=NONE
atxy7.menu.millis.timera.build.millistimer=A0
atxy7.menu.millis.timerd.build.millistimer=D0
atxy7.menu.millis.timerb0.build.millistimer=B0
atxy7.menu.millis.timerb1.build.millistimer=B1
atxy7.menu.millis.rtc.build.millistimer=RTC
atxy7.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy7.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
atxy7.menu.resetpin.UPDI=UPDI (no reset pin)
atxy7.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
atxy7.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy7.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy7.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy7.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy7.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy7.menu.startuptime.8=8ms
atxy7.menu.startuptime.0=0ms
atxy7.menu.startuptime.1=1ms
atxy7.menu.startuptime.2=2ms
atxy7.menu.startuptime.4=4ms
atxy7.menu.startuptime.16=16ms
atxy7.menu.startuptime.32=32ms
atxy7.menu.startuptime.64=64ms
atxy7.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy7.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy7.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy7.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy7.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy7.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy7.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy7.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy7.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy7.menu.wiremode.mors.build.wire=MORS
atxy7.menu.wiremode.mands=Master and Slave
atxy7.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy7.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy7.menu.printf.full=Full, 2.6k, prints floats
atxy7.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy7.menu.printf.full.build.printfabr=.pfF
atxy7.menu.printf.minimal=Minimal, 1.1k flash used
atxy7.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy7.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy7.menu.attach.allenabled=On all pins, new implementation.
atxy7.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy7.menu.attach.manual=Only enabled ports
atxy7.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy7.menu.attach.oldversion=Old version, may fix bugs.
atxy7.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy7.menu.attach.manual.build.attachabr=.aMan
atxy7.menu.attach.oldversion.build.attachabr=.aOld

##########################################################################
#  Non-bootloader                                                        #
#                                ##    ###      ####   ###  #   #      ###
#  ATtiny3226/3216              #  #  #   #     #   #   #   ##  #    #####
#  ATtiny1626/1616/1606           #   #   # === ####    #   # # #  #######
#  ATtiny826/816/806             #    #   #     #       #   #  ##    #####
#  ATtiny427/416/406            ####   ###      #      ###  #   #      ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy6.build.text_section_start=.text=0x0
atxy6.build.millistimer=D0
atxy6.build.bootload=
atxy6.build.board=AVR_ATtinyxy6
atxy6.build.clocksource=0
atxy6.build.core=megatinycore
atxy6.build.variant=txy6
atxy6.build.tuned=
atxy6.build.printf=
atxy6.build.wire=MORS
atxy6.build.attachmode=-DCORE_ATTACH_ALL
atxy6.build.mcu=attiny{build.attiny}
atxy6.build.f_cpu={build.speed}000000L
atxy6.build.extra_flags=-DARDUINO_attinyxy6 {build.tuned}
atxy6.build.export_merged_output=false

