SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy4.bootloader.WDTCFG=0x00
atxy4.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4.bootloader.OSCCFG=0x01
atxy4.bootloader.TCD0CFG_avrdude=
atxy4.bootloader.TCD0CFG_serialupdi=
atxy4.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy4.bootloader.APPEND=0x00
atxy4.bootloader.BOOTEND=0x00
atxy4.bootloader.resetpinbits=01
atxy4.bootloader.avrdudestring=
atxy4.bootloader.serialupdistring=-aerase
atxy4.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy4.build.bootload=
atxy4.build.printfabr=
atxy4.build.attachabr=
atxy4.build.wireabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy4.upload.tool=avrdude
atxy4.upload.workaround=
atxy4.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy4.menu.chip.1614=ATtiny1614
atxy4.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4.menu.chip.1614.build.attiny=1614
atxy4.menu.chip.1614.upload.maximum_size=16384
atxy4.menu.chip.1614.upload.maximum_data_size=2048
atxy4.menu.chip.1614.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.1614.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.814=ATtiny814
atxy4.menu.chip.814.build.board=AVR_ATtiny814
atxy4.menu.chip.814.build.attiny=814
atxy4.menu.chip.814.upload.maximum_size=8192
atxy4.menu.chip.814.upload.maximum_data_size=512
atxy4.menu.chip.814.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.814.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.414=ATtiny414
atxy4.menu.chip.414.build.board=AVR_ATtiny414
atxy4.menu.chip.414.build.attiny=414
atxy4.menu.chip.414.upload.maximum_size=4096
atxy4.menu.chip.414.upload.maximum_data_size=256
atxy4.menu.chip.414.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.414.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.214=ATtiny214
atxy4.menu.chip.214.build.board=AVR_ATtiny214
atxy4.menu.chip.214.build.attiny=214
atxy4.menu.chip.214.upload.maximum_size=2048
atxy4.menu.chip.214.upload.maximum_data_size=128
atxy4.menu.chip.214.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.214.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.3224=ATtiny3224
atxy4.menu.chip.3224.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.3224.build.board=AVR_ATtiny3224
atxy4.menu.chip.3224.build.millistimer=B1
atxy4.menu.chip.3224.build.attiny=3224
atxy4.menu.chip.3224.upload.maximum_size=32768
atxy4.menu.chip.3224.upload.maximum_data_size=3072
atxy4.menu.chip.1624=ATtiny1624
atxy4.menu.chip.1624.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.1624.build.board=AVR_ATtiny1624
atxy4.menu.chip.1624.build.millistimer=B1
atxy4.menu.chip.1624.build.attiny=1624
atxy4.menu.chip.1624.upload.maximum_size=16384
atxy4.menu.chip.1624.upload.maximum_data_size=2048
atxy4.menu.chip.824=ATtiny824
atxy4.menu.chip.824.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.824.build.board=AVR_ATtiny824
atxy4.menu.chip.824.build.millistimer=B1
atxy4.menu.chip.824.build.attiny=824
atxy4.menu.chip.824.upload.maximum_size=8192
atxy4.menu.chip.824.upload.maximum_data_size=1024
atxy4.menu.chip.424=ATtiny424
atxy4.menu.chip.424.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.424.build.board=AVR_ATtiny424
atxy4.menu.chip.424.build.millistimer=B1
atxy4.menu.chip.424.build.attiny=424
atxy4.menu.chip.424.upload.maximum_size=4096
atxy4.menu.chip.424.upload.maximum_data_size=512
atxy4.menu.chip.1604=ATtiny1604
atxy4.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4.menu.chip.1604.build.attiny=1604
atxy4.menu.chip.1604.build.millistimer=A0
atxy4.menu.chip.1604.upload.maximum_size=16384
atxy4.menu.chip.1604.upload.maximum_data_size=1024
atxy4.menu.chip.804=ATtiny804
atxy4.menu.chip.804.build.board=AVR_ATtiny804
atxy4.menu.chip.804.build.attiny=804
atxy4.menu.chip.804.build.millistimer=A0
atxy4.menu.chip.804.upload.maximum_size=8192
atxy4.menu.chip.804.upload.maximum_data_size=512
atxy4.menu.chip.404=ATtiny404
atxy4.menu.chip.404.build.board=AVR_ATtiny404
atxy4.menu.chip.404.build.attiny=404
atxy4.menu.chip.404.build.millistimer=A0
atxy4.menu.chip.404.upload.maximum_size=4096
atxy4.menu.chip.404.upload.maximum_data_size=256
atxy4.menu.chip.204=ATtiny204
atxy4.menu.chip.204.build.board=AVR_ATtiny204
atxy4.menu.chip.204.build.attiny=204
atxy4.menu.chip.204.build.millistimer=A0
atxy4.menu.chip.204.upload.maximum_size=2048
atxy4.menu.chip.204.upload.maximum_data_size=128

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy4.menu.clock.20internal=20 MHz internal
atxy4.menu.clock.16internal=16 MHz internal
atxy4.menu.clock.10internal=10 MHz internal
atxy4.menu.clock.8internal=8 MHz internal
atxy4.menu.clock.5internal=5 MHz internal
atxy4.menu.clock.4internal=4 MHz internal
atxy4.menu.clock.1internal=1 MHz internal
atxy4.menu.clock.20internaltuned=20 MHz internal - tuned
atxy4.menu.clock.16internaltuned=16 MHz internal - tuned
atxy4.menu.clock.12internaltuned=12 MHz internal - tuned
atxy4.menu.clock.20extclock=20 MHz external clock
atxy4.menu.clock.16extclock=16 MHz external clock
atxy4.menu.clock.12extclock=12 MHz external clock
atxy4.menu.clock.10extclock=10 MHz external clock
atxy4.menu.clock.8extclock=8 MHz external clock
atxy4.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy4.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy4.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy4.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy4.menu.clock.24extclock=24 MHz external clock - overclocked
atxy4.menu.clock.25extclock=25 MHz external clock - overclocked
atxy4.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy4.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy4.menu.clock.20internal.build.speed=20
atxy4.menu.clock.20internal.build.clocksource=0
atxy4.menu.clock.16internal.build.speed=16
atxy4.menu.clock.16internal.build.clocksource=0
atxy4.menu.clock.10internal.build.speed=10
atxy4.menu.clock.10internal.build.clocksource=0
atxy4.menu.clock.8internal.build.speed=8
atxy4.menu.clock.8internal.build.clocksource=0
atxy4.menu.clock.5internal.build.speed=5
atxy4.menu.clock.5internal.build.clocksource=0
atxy4.menu.clock.4internal.build.speed=4
atxy4.menu.clock.4internal.build.clocksource=0
atxy4.menu.clock.1internal.build.speed=1
atxy4.menu.clock.1internal.build.clocksource=0
atxy4.menu.clock.20extclock.build.speed=20
atxy4.menu.clock.20extclock.build.clocksource=2
atxy4.menu.clock.16extclock.build.speed=16
atxy4.menu.clock.16extclock.build.clocksource=2
atxy4.menu.clock.12extclock.build.speed=12
atxy4.menu.clock.12extclock.build.clocksource=2
atxy4.menu.clock.10extclock.build.speed=10
atxy4.menu.clock.10extclock.build.clocksource=2
atxy4.menu.clock.8extclock.build.speed=8
atxy4.menu.clock.8extclock.build.clocksource=2
atxy4.menu.clock.24extclock.build.speed=24
atxy4.menu.clock.24extclock.build.clocksource=2
atxy4.menu.clock.25extclock.build.speed=24
atxy4.menu.clock.25extclock.build.clocksource=2
atxy4.menu.clock.30extclock.build.speed=30
atxy4.menu.clock.30extclock.build.clocksource=2
atxy4.menu.clock.32extclock.build.speed=32
atxy4.menu.clock.32extclock.build.clocksource=2
atxy4.menu.clock.20internaltuned.build.speed=20
atxy4.menu.clock.20internaltuned.build.clocksource=0
atxy4.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.16internaltuned.build.speed=16
atxy4.menu.clock.16internaltuned.build.clocksource=0
atxy4.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.12internaltuned.build.speed=12
atxy4.menu.clock.12internaltuned.build.clocksource=0
atxy4.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.24internaltuned.build.speed=24
atxy4.menu.clock.24internaltuned.build.clocksource=0
atxy4.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.25internaltuned.build.speed=25
atxy4.menu.clock.25internaltuned.build.clocksource=0
atxy4.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.30internaltuned.build.speed=30
atxy4.menu.clock.30internaltuned.build.clocksource=0
atxy4.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.32internaltuned.build.speed=32
atxy4.menu.clock.32internaltuned.build.clocksource=0
atxy4.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy4.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy4.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy4.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy4.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atxy4.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy4.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy4.menu.clock.5internal.bootloader.OSCCFG=0x02

