SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.OSCCFG=0x01
atxy2.bootloader.TCD0CFG_avrdude=
atxy2.bootloader.TCD0CFG_serialupdi=
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.resetpinbits=01
atxy2.bootloader.avrdudestring=
atxy2.bootloader.serialupdistring=-aerase
atxy2.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy2.build.bootload=
atxy2.build.printfabr=
atxy2.build.attachabr=
atxy2.build.wireabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy2.upload.tool=avrdude
atxy2.upload.workaround=
atxy2.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
#  8-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.board=AVR_ATtiny412
atxy2.menu.chip.412.build.attiny=412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.412.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.412.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.board=AVR_ATtiny212
atxy2.menu.chip.212.build.attiny=212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.212.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.212.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.board=AVR_ATtiny402
atxy2.menu.chip.402.build.attiny=402
atxy2.menu.chip.402.build.millistimer=A0
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.millistimer=A0
atxy2.menu.chip.402w.build.board=AVR_ATtiny402
atxy2.menu.chip.402w.build.attiny=402
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.402w.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402w.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.board=AVR_ATtiny202
atxy2.menu.chip.202.build.attiny=202
atxy2.menu.chip.202.build.millistimer=A0
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128
atxy2.menu.chip.202.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.202.bootloader.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy2.menu.clock.20internal=20 MHz internal
atxy2.menu.clock.16internal=16 MHz internal
atxy2.menu.clock.10internal=10 MHz internal
atxy2.menu.clock.8internal=8 MHz internal
atxy2.menu.clock.5internal=5 MHz internal
atxy2.menu.clock.4internal=4 MHz internal
atxy2.menu.clock.1internal=1 MHz internal
atxy2.menu.clock.20internaltuned=20 MHz internal - tuned
atxy2.menu.clock.16internaltuned=16 MHz internal - tuned
atxy2.menu.clock.12internaltuned=12 MHz internal - tuned
atxy2.menu.clock.20extclock=20 MHz external clock
atxy2.menu.clock.16extclock=16 MHz external clock
atxy2.menu.clock.12extclock=12 MHz external clock
atxy2.menu.clock.10extclock=10 MHz external clock
atxy2.menu.clock.8extclock=8 MHz external clock
atxy2.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy2.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy2.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.24extclock=24 MHz external clock - overclocked
atxy2.menu.clock.25extclock=25 MHz external clock - overclocked
atxy2.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.20internal.build.speed=20
atxy2.menu.clock.20internal.build.clocksource=0
atxy2.menu.clock.16internal.build.speed=16
atxy2.menu.clock.16internal.build.clocksource=0
atxy2.menu.clock.10internal.build.speed=10
atxy2.menu.clock.10internal.build.clocksource=0
atxy2.menu.clock.8internal.build.speed=8
atxy2.menu.clock.8internal.build.clocksource=0
atxy2.menu.clock.5internal.build.speed=5
atxy2.menu.clock.5internal.build.clocksource=0
atxy2.menu.clock.4internal.build.speed=4
atxy2.menu.clock.4internal.build.clocksource=0
atxy2.menu.clock.1internal.build.speed=1
atxy2.menu.clock.1internal.build.clocksource=0
atxy2.menu.clock.20extclock.build.speed=20
atxy2.menu.clock.20extclock.build.clocksource=2
atxy2.menu.clock.16extclock.build.speed=16
atxy2.menu.clock.16extclock.build.clocksource=2
atxy2.menu.clock.12extclock.build.speed=12
atxy2.menu.clock.12extclock.build.clocksource=2
atxy2.menu.clock.10extclock.build.speed=10
atxy2.menu.clock.10extclock.build.clocksource=2
atxy2.menu.clock.8extclock.build.speed=8
atxy2.menu.clock.8extclock.build.clocksource=2
atxy2.menu.clock.24extclock.build.speed=24
atxy2.menu.clock.24extclock.build.clocksource=2
atxy2.menu.clock.25extclock.build.speed=24
atxy2.menu.clock.25extclock.build.clocksource=2
atxy2.menu.clock.30extclock.build.speed=30
atxy2.menu.clock.30extclock.build.clocksource=2
atxy2.menu.clock.32extclock.build.speed=32
atxy2.menu.clock.32extclock.build.clocksource=2
atxy2.menu.clock.20internaltuned.build.speed=20
atxy2.menu.clock.20internaltuned.build.clocksource=0
atxy2.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.16internaltuned.build.speed=16
atxy2.menu.clock.16internaltuned.build.clocksource=0
atxy2.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.12internaltuned.build.speed=12
atxy2.menu.clock.12internaltuned.build.clocksource=0
atxy2.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.24internaltuned.build.speed=24
atxy2.menu.clock.24internaltuned.build.clocksource=0
atxy2.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.25internaltuned.build.speed=25
atxy2.menu.clock.25internaltuned.build.clocksource=0
atxy2.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.30internaltuned.build.speed=30
atxy2.menu.clock.30internaltuned.build.clocksource=0
atxy2.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.32internaltuned.build.speed=32
atxy2.menu.clock.32internaltuned.build.clocksource=0
atxy2.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.5internal.bootloader.OSCCFG=0x02

