SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
microchip.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchip.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchip.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchip.menu.bodvoltage.2v1=2.1V (Unofficial)
microchip.menu.bodvoltage.2v9=2.9V (Unofficial)
microchip.menu.bodvoltage.3v3=3.3V (Unofficial)
microchip.menu.bodvoltage.3v7=3.7V (Unofficial)
microchip.menu.bodvoltage.4v0=4.0V (Unofficial)
microchip.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchip.menu.bodvoltage.2v1.bootloader.bodlevbits=001
microchip.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchip.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchip.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchip.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchip.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchip.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
microchip.menu.bodmode.disabled=Disabled/Disabled
microchip.menu.bodmode.enabled=Enabled/Enabled
microchip.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchip.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchip.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchip.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchip.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchip.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchip.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchip.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchip.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchip.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchip.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchip.menu.bodmode.samplefast.bootloader.bodmodebits=01010
microchip.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
microchip.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchip.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchip.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
microchip.menu.eesave.enable=EEPROM retained
microchip.menu.eesave.enable.bootloader.eesavebit=1
microchip.menu.eesave.disable=EEPROM not retained
microchip.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
microchip.menu.millis.enabled=Enabled (default timer)
microchip.menu.millis.disabled=Disabled (saves flash)
microchip.menu.millis.timera=TCA0 (default on 0-series)
microchip.menu.millis.timerd=TCD0 (1-series only, default there)
microchip.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
microchip.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
microchip.menu.millis.rtc=RTC (no micros)
microchip.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
microchip.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
microchip.menu.millis.disabled.build.millistimer=NONE
microchip.menu.millis.timera.build.millistimer=A0
microchip.menu.millis.timerd.build.millistimer=D0
microchip.menu.millis.timerb0.build.millistimer=B0
microchip.menu.millis.timerb1.build.millistimer=B1
microchip.menu.millis.rtc.build.millistimer=RTC
microchip.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
microchip.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
microchip.menu.resetpin.UPDI=UPDI (no reset pin)
microchip.menu.resetpin.UPDI.bootloader.resetpinbits=01
microchip.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
microchip.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
# the microchip debuggers are not 12v tolerant so nothing that would need hv programming to reset is supported. And if you cut the straps to debugger, you shouldn't be using this board definition.

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
microchip.menu.startuptime.8=8ms
microchip.menu.startuptime.0=0ms
microchip.menu.startuptime.1=1ms
microchip.menu.startuptime.2=2ms
microchip.menu.startuptime.4=4ms
microchip.menu.startuptime.16=16ms
microchip.menu.startuptime.32=32ms
microchip.menu.startuptime.64=64ms
microchip.menu.startuptime.0.bootloader.SYSCFG1=0x00
microchip.menu.startuptime.1.bootloader.SYSCFG1=0x01
microchip.menu.startuptime.2.bootloader.SYSCFG1=0x02
microchip.menu.startuptime.4.bootloader.SYSCFG1=0x03
microchip.menu.startuptime.8.bootloader.SYSCFG1=0x04
microchip.menu.startuptime.16.bootloader.SYSCFG1=0x05
microchip.menu.startuptime.32.bootloader.SYSCFG1=0x06
microchip.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
microchip.menu.wiremode.mors=Master or Slave (saves flash and RAM)
microchip.menu.wiremode.mors.build.wire=MORS
microchip.menu.wiremode.mands=Master and Slave
microchip.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
microchip.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
microchip.menu.printf.full=Full, 2.6k, prints floats
microchip.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
microchip.menu.printf.full.build.printfabr=.pfF
microchip.menu.printf.minimal=Minimal, 1.1k flash used
microchip.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
microchip.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
microchip.menu.attach.allenabled=On all pins, like usual
microchip.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
microchip.menu.attach.manual=Only enabled ports
microchip.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
microchip.menu.attach.oldversion=Old version, (may fix bugs)
microchip.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
microchip.menu.attach.manual.build.attachabr=.aMan
microchip.menu.attach.oldversion.build.attachabr=.aOld

##########################################################################
##########################################################################
#                                                                        #
#           ###   ####   #####  ###  ####    ###    ###   #####          #
#          #   #  #   #    #     #   #   #  #   #  #   #    #            #
#          #   #  ####     #     #   ####   #   #  #   #    #            #
#          #   #  #        #     #   #   #  #   #  #   #    #            #
#           ###   #        #    ###  ####    ###    ###     #            #
#________________________________________________________________________#
##########################################################################

##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    ##   #  #     ####   ###  #   #         #
#                               #  #  #  #     #   #   #   ##  #         #
#  ATtiny3217/1617                #   #### === ####    #   # # #         #
#  ATtiny1607/817                #       #     #       #   #  ##         #
#  ATtiny807/417                ####     #     #      ###  #   #         #
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy7o.build.text_section_start=.text=0x200
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.clocksource=0
atxy7o.build.core=megatinycore
atxy7o.build.variant=txy7
atxy7o.build.tuned=
atxy7o.build.printf=
atxy7o.build.wire=MORS
atxy7o.build.attachmode=-DCORE_ATTACH_ALL
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.build.extra_flags=-DARDUINO_attinyxy7 -DUSING_OPTIBOOT {build.tuned}
atxy7o.build.export_merged_output=true

