SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7o.bootloader.OSCCFG=0x01
atxy7o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02
atxy7o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy7o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy7o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy7o.build.printfabr=
atxy7o.build.attachabr=
atxy7o.build.wireabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy7o.upload.workaround=
atxy7o.upload.tool=avrdude
atxy7o.upload.protocol=arduino
atxy7o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy7o.upload.extra_params=-D -P{serial.port} -b115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 24-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=AVR_ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=AVR_ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.1607.bootloader.TCD0CFG_avrdude=
atxy7o.menu.chip.1607.bootloader.TCD0CFG_serialupdi=
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=AVR_ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512
atxy7o.menu.chip.807.bootloader.TCD0CFG_avrdude=
atxy7o.menu.chip.807.bootloader.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy7o.menu.clocko.20internal=20 MHz internal
atxy7o.menu.clocko.16internal=16 MHz internal
atxy7o.menu.clocko.10internal=10 MHz internal
atxy7o.menu.clocko.8internal=8 MHz internal
atxy7o.menu.clocko.5internal=5 MHz internal
atxy7o.menu.clocko.4internal=4 MHz internal
atxy7o.menu.clocko.1internal=1 MHz internal
atxy7o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy7o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy7o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy7o.menu.clocko.20extclock=20 MHz external clock
atxy7o.menu.clocko.16extclock=16 MHz external clock
atxy7o.menu.clocko.12extclock=12 MHz external clock
atxy7o.menu.clocko.10extclock=10 MHz external clock
atxy7o.menu.clocko.8extclock=8 MHz external clock
atxy7o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy7o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy7o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy7o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy7o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy7o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy7o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy7o.menu.clocko.20internal.build.speed=20
atxy7o.menu.clocko.20internal.build.clocksource=0
atxy7o.menu.clocko.16internal.build.speed=16
atxy7o.menu.clocko.16internal.build.clocksource=0
atxy7o.menu.clocko.10internal.build.speed=10
atxy7o.menu.clocko.10internal.build.clocksource=0
atxy7o.menu.clocko.8internal.build.speed=8
atxy7o.menu.clocko.8internal.build.clocksource=0
atxy7o.menu.clocko.5internal.build.speed=5
atxy7o.menu.clocko.5internal.build.clocksource=0
atxy7o.menu.clocko.4internal.build.speed=4
atxy7o.menu.clocko.4internal.build.clocksource=0
atxy7o.menu.clocko.1internal.build.speed=1
atxy7o.menu.clocko.1internal.build.clocksource=0
atxy7o.menu.clocko.20extclock.build.speed=20
atxy7o.menu.clocko.20extclock.build.clocksource=2
atxy7o.menu.clocko.16extclock.build.speed=16
atxy7o.menu.clocko.16extclock.build.clocksource=2
atxy7o.menu.clocko.12extclock.build.speed=12
atxy7o.menu.clocko.12extclock.build.clocksource=2
atxy7o.menu.clocko.10extclock.build.speed=10
atxy7o.menu.clocko.10extclock.build.clocksource=2
atxy7o.menu.clocko.8extclock.build.speed=8
atxy7o.menu.clocko.8extclock.build.clocksource=2
atxy7o.menu.clocko.24extclock.build.speed=24
atxy7o.menu.clocko.24extclock.build.clocksource=2
atxy7o.menu.clocko.25extclock.build.speed=24
atxy7o.menu.clocko.25extclock.build.clocksource=2
atxy7o.menu.clocko.30extclock.build.speed=30
atxy7o.menu.clocko.30extclock.build.clocksource=2
atxy7o.menu.clocko.32extclock.build.speed=32
atxy7o.menu.clocko.32extclock.build.clocksource=2
atxy7o.menu.clocko.20internaltuned.build.speed=20
atxy7o.menu.clocko.20internaltuned.build.clocksource=0
atxy7o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.16internaltuned.build.speed=16
atxy7o.menu.clocko.16internaltuned.build.clocksource=0
atxy7o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.12internaltuned.build.speed=12
atxy7o.menu.clocko.12internaltuned.build.clocksource=0
atxy7o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.24internaltuned.build.speed=24
atxy7o.menu.clocko.24internaltuned.build.clocksource=0
atxy7o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.25internaltuned.build.speed=25
atxy7o.menu.clocko.25internaltuned.build.clocksource=0
atxy7o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.30internaltuned.build.speed=30
atxy7o.menu.clocko.30internaltuned.build.clocksource=0
atxy7o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.5internal.bootloader.OSCCFG=0x02

