SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy7o.menu.attach.allenabled=On all pins, like usual
atxy7o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy7o.menu.attach.manual=Only enabled ports
atxy7o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy7o.menu.attach.oldversion=Old version, (may fix bugs)
atxy7o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy7o.menu.attach.manual.build.attachabr=.aMan
atxy7o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      ##   #  #     ####   ###  #   #    ##   ###
#                               #  #  #  #     #   #   #   ##  #    ##   ###
#  ATtiny3227/1627                #   #### === ####    #   # # #    ##   ###
#  ATtiny827/427                 #       #     #       #   #  ##    ##   ###
#                               ####     #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx27o.build.text_section_start=.text=0x200
atx27o.build.millistimer=B1
atx27o.build.bootload=opti
atx27o.build.board=AVR_ATtinyxy7
atx27o.build.clocksource=0
atx27o.build.core=megatinycore
atx27o.build.variant=txy7
atx27o.build.tuned=
atx27o.build.printf=
atx27o.build.wire=MORS
atx27o.build.attachmode=-DCORE_ATTACH_ALL
atx27o.build.mcu=attiny{build.attiny}
atx27o.build.f_cpu={build.speed}000000L
atx27o.build.extra_flags=-DARDUINO_attinyx27 -DUSING_OPTIBOOT {build.tuned}
atx27o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atx27o.bootloader.WDTCFG=0x00
atx27o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx27o.bootloader.OSCCFG=0x01
atx27o.bootloader.TCD0CFG_avrdude=
atx27o.bootloader.TCD0CFG_serialupdi=
atx27o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx27o.bootloader.APPEND=0x00
atx27o.bootloader.BOOTEND=0x02
atx27o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx27o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atx27o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx27o.build.printfabr=
atx27o.build.attachabr=
atx27o.build.wireabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atx27o.upload.workaround=
atx27o.upload.tool=avrdude
atx27o.upload.protocol=arduino
atx27o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atx27o.upload.extra_params=-D -P{serial.port} -b115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 24-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atx27o.menu.chip.3227=ATtiny3227
atx27o.menu.chip.3227.build.board=AVR_ATtiny3227
atx27o.menu.chip.3227.build.attiny=3227
atx27o.menu.chip.3227.upload.maximum_size=32256
atx27o.menu.chip.3227.upload.maximum_data_size=3072
atx27o.menu.chip.1627=ATtiny1627
atx27o.menu.chip.1627.build.board=AVR_ATtiny1627
atx27o.menu.chip.1627.build.attiny=1627
atx27o.menu.chip.1627.upload.maximum_size=15872
atx27o.menu.chip.1627.upload.maximum_data_size=2048
atx27o.menu.chip.827=ATtiny827
atx27o.menu.chip.827.build.board=AVR_ATtiny827
atx27o.menu.chip.827.build.attiny=827
atx27o.menu.chip.827.upload.maximum_size=7680
atx27o.menu.chip.827.upload.maximum_data_size=1024
atx27o.menu.chip.427=ATtiny427
atx27o.menu.chip.427.build.board=AVR_ATtiny427
atx27o.menu.chip.427.build.attiny=427
atx27o.menu.chip.427.upload.maximum_size=3584
atx27o.menu.chip.427.upload.maximum_data_size=512

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atx27o.menu.clocko.20internal=20 MHz internal
atx27o.menu.clocko.16internal=16 MHz internal
atx27o.menu.clocko.10internal=10 MHz internal
atx27o.menu.clocko.8internal=8 MHz internal
atx27o.menu.clocko.5internal=5 MHz internal
atx27o.menu.clocko.4internal=4 MHz internal
atx27o.menu.clocko.1internal=1 MHz internal
atx27o.menu.clocko.20internaltuned=20 MHz internal - tuned
atx27o.menu.clocko.16internaltuned=16 MHz internal - tuned
atx27o.menu.clocko.12internaltuned=12 MHz internal - tuned
atx27o.menu.clocko.20extclock=20 MHz external clock
atx27o.menu.clocko.16extclock=16 MHz external clock
atx27o.menu.clocko.12extclock=12 MHz external clock
atx27o.menu.clocko.10extclock=10 MHz external clock
atx27o.menu.clocko.8extclock=8 MHz external clock
atx27o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atx27o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atx27o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx27o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx27o.menu.clocko.24extclock=24 MHz external clock - overclocked
atx27o.menu.clocko.25extclock=25 MHz external clock - overclocked
atx27o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atx27o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atx27o.menu.clocko.20internal.build.speed=20
atx27o.menu.clocko.20internal.build.clocksource=0
atx27o.menu.clocko.16internal.build.speed=16
atx27o.menu.clocko.16internal.build.clocksource=0
atx27o.menu.clocko.10internal.build.speed=10
atx27o.menu.clocko.10internal.build.clocksource=0
atx27o.menu.clocko.8internal.build.speed=8
atx27o.menu.clocko.8internal.build.clocksource=0
atx27o.menu.clocko.5internal.build.speed=5
atx27o.menu.clocko.5internal.build.clocksource=0
atx27o.menu.clocko.4internal.build.speed=4
atx27o.menu.clocko.4internal.build.clocksource=0
atx27o.menu.clocko.1internal.build.speed=1
atx27o.menu.clocko.1internal.build.clocksource=0
atx27o.menu.clocko.20extclock.build.speed=20
atx27o.menu.clocko.20extclock.build.clocksource=2
atx27o.menu.clocko.16extclock.build.speed=16
atx27o.menu.clocko.16extclock.build.clocksource=2
atx27o.menu.clocko.12extclock.build.speed=12
atx27o.menu.clocko.12extclock.build.clocksource=2
atx27o.menu.clocko.10extclock.build.speed=10
atx27o.menu.clocko.10extclock.build.clocksource=2
atx27o.menu.clocko.8extclock.build.speed=8
atx27o.menu.clocko.8extclock.build.clocksource=2
atx27o.menu.clocko.24extclock.build.speed=24
atx27o.menu.clocko.24extclock.build.clocksource=2
atx27o.menu.clocko.25extclock.build.speed=24
atx27o.menu.clocko.25extclock.build.clocksource=2
atx27o.menu.clocko.30extclock.build.speed=30
atx27o.menu.clocko.30extclock.build.clocksource=2
atx27o.menu.clocko.32extclock.build.speed=32
atx27o.menu.clocko.32extclock.build.clocksource=2
atx27o.menu.clocko.20internaltuned.build.speed=20
atx27o.menu.clocko.20internaltuned.build.clocksource=0
atx27o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.16internaltuned.build.speed=16
atx27o.menu.clocko.16internaltuned.build.clocksource=0
atx27o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.12internaltuned.build.speed=12
atx27o.menu.clocko.12internaltuned.build.clocksource=0
atx27o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.24internaltuned.build.speed=24
atx27o.menu.clocko.24internaltuned.build.clocksource=0
atx27o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.25internaltuned.build.speed=25
atx27o.menu.clocko.25internaltuned.build.clocksource=0
atx27o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.30internaltuned.build.speed=30
atx27o.menu.clocko.30internaltuned.build.clocksource=0
atx27o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.32internaltuned.build.speed=32
atx27o.menu.clocko.32internaltuned.build.clocksource=0
atx27o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atx27o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atx27o.menu.clocko.5internal.bootloader.OSCCFG=0x02

