SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
atx27o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx27o.menu.printf.full=Full, 2.6k, prints floats
atx27o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx27o.menu.printf.full.build.printfabr=.pfF
atx27o.menu.printf.minimal=Minimal, 1.1k flash used
atx27o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx27o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx27o.menu.attach.allenabled=On all pins, like usual
atx27o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx27o.menu.attach.manual=Only enabled ports
atx27o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx27o.menu.attach.oldversion=Old version, (may fix bugs)
atx27o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx27o.menu.attach.manual.build.attachabr=.aMan
atx27o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    ##    ###      ####   ###  #   #        ###
#                               #  #  #   #     #   #   #   ##  #        ###
#  ATtiny3216/1616/1606           #   #   # === ####    #   # # #        ###
#  ATtiny816/806                 #    #   #     #       #   #  ##        ###
#  ATtiny416/406                ####   ###      #      ###  #   #        ###
#________________________________________________________________________###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atxy6o.build.text_section_start=.text=0x200
atxy6o.build.millistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.board=AVR_ATtinyxy6
atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.variant=txy6
atxy6o.build.tuned=
atxy6o.build.printf=
atxy6o.build.wire=MORS
atxy6o.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 -DUSING_OPTIBOOT {build.tuned}
atxy6o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.OSCCFG=0x01
atxy6o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x02
atxy6o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy6o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy6o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy6o.build.printfabr=
atxy6o.build.attachabr=
atxy6o.build.wireabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy6o.upload.workaround=
atxy6o.upload.tool=avrdude
atxy6o.upload.protocol=arduino
atxy6o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy6o.upload.extra_params=-D -P{serial.port} -b115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 20-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6o.menu.chip.3216.build.attiny=3216
atxy6o.menu.chip.3216.upload.maximum_size=32256
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6o.menu.chip.1616.build.attiny=1616
atxy6o.menu.chip.1616.upload.maximum_size=15872
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.board=AVR_ATtiny816
atxy6o.menu.chip.816.build.attiny=816
atxy6o.menu.chip.816.upload.maximum_size=7680
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.board=AVR_ATtiny416
atxy6o.menu.chip.416.build.attiny=416
atxy6o.menu.chip.416.upload.maximum_size=3584
atxy6o.menu.chip.416.upload.maximum_data_size=256
atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6o.menu.chip.1606.build.attiny=1606
atxy6o.menu.chip.1606.build.millistimer=A0
atxy6o.menu.chip.1606.upload.maximum_size=15872
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.1606.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.1606.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.board=AVR_ATtiny806
atxy6o.menu.chip.806.build.attiny=806
atxy6o.menu.chip.806.build.millistimer=A0
atxy6o.menu.chip.806.upload.maximum_size=7680
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.806.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.806.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.board=AVR_ATtiny406
atxy6o.menu.chip.406.build.attiny=406
atxy6o.menu.chip.406.build.millistimer=A0
atxy6o.menu.chip.406.upload.maximum_size=3584
atxy6o.menu.chip.406.upload.maximum_data_size=256
atxy6o.menu.chip.406.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.406.bootloader.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy6o.menu.clocko.20internal=20 MHz internal
atxy6o.menu.clocko.16internal=16 MHz internal
atxy6o.menu.clocko.10internal=10 MHz internal
atxy6o.menu.clocko.8internal=8 MHz internal
atxy6o.menu.clocko.5internal=5 MHz internal
atxy6o.menu.clocko.4internal=4 MHz internal
atxy6o.menu.clocko.1internal=1 MHz internal
atxy6o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy6o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy6o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy6o.menu.clocko.20extclock=20 MHz external clock
atxy6o.menu.clocko.16extclock=16 MHz external clock
atxy6o.menu.clocko.12extclock=12 MHz external clock
atxy6o.menu.clocko.10extclock=10 MHz external clock
atxy6o.menu.clocko.8extclock=8 MHz external clock
atxy6o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy6o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy6o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy6o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy6o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy6o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.20internal.build.speed=20
atxy6o.menu.clocko.20internal.build.clocksource=0
atxy6o.menu.clocko.16internal.build.speed=16
atxy6o.menu.clocko.16internal.build.clocksource=0
atxy6o.menu.clocko.10internal.build.speed=10
atxy6o.menu.clocko.10internal.build.clocksource=0
atxy6o.menu.clocko.8internal.build.speed=8
atxy6o.menu.clocko.8internal.build.clocksource=0
atxy6o.menu.clocko.5internal.build.speed=5
atxy6o.menu.clocko.5internal.build.clocksource=0
atxy6o.menu.clocko.4internal.build.speed=4
atxy6o.menu.clocko.4internal.build.clocksource=0
atxy6o.menu.clocko.1internal.build.speed=1
atxy6o.menu.clocko.1internal.build.clocksource=0
atxy6o.menu.clocko.20extclock.build.speed=20
atxy6o.menu.clocko.20extclock.build.clocksource=2
atxy6o.menu.clocko.16extclock.build.speed=16
atxy6o.menu.clocko.16extclock.build.clocksource=2
atxy6o.menu.clocko.12extclock.build.speed=12
atxy6o.menu.clocko.12extclock.build.clocksource=2
atxy6o.menu.clocko.10extclock.build.speed=10
atxy6o.menu.clocko.10extclock.build.clocksource=2
atxy6o.menu.clocko.8extclock.build.speed=8
atxy6o.menu.clocko.8extclock.build.clocksource=2
atxy6o.menu.clocko.24extclock.build.speed=24
atxy6o.menu.clocko.24extclock.build.clocksource=2
atxy6o.menu.clocko.25extclock.build.speed=24
atxy6o.menu.clocko.25extclock.build.clocksource=2
atxy6o.menu.clocko.30extclock.build.speed=30
atxy6o.menu.clocko.30extclock.build.clocksource=2
atxy6o.menu.clocko.32extclock.build.speed=32
atxy6o.menu.clocko.32extclock.build.clocksource=2
atxy6o.menu.clocko.20internaltuned.build.speed=20
atxy6o.menu.clocko.20internaltuned.build.clocksource=0
atxy6o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.16internaltuned.build.speed=16
atxy6o.menu.clocko.16internaltuned.build.clocksource=0
atxy6o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.12internaltuned.build.speed=12
atxy6o.menu.clocko.12internaltuned.build.clocksource=0
atxy6o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.24internaltuned.build.speed=24
atxy6o.menu.clocko.24internaltuned.build.clocksource=0
atxy6o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.25internaltuned.build.speed=25
atxy6o.menu.clocko.25internaltuned.build.clocksource=0
atxy6o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.30internaltuned.build.speed=30
atxy6o.menu.clocko.30internaltuned.build.clocksource=0
atxy6o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.5internal.bootloader.OSCCFG=0x02

