SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy6o.menu.attach.allenabled=On all pins, like usual
atxy6o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.menu.attach.manual=Only enabled ports
atxy6o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy6o.menu.attach.oldversion=Old version, (may fix bugs)
atxy6o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy6o.menu.attach.manual.build.attachabr=.aMan
atxy6o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      ##    ###      ####   ###  #   #   ##   ###
#                               #  #  #   #     #   #   #   ##  #   ##   ###
#  ATtiny3226/1626                #   #   # === ####    #   # # #   ##   ###
#  ATtiny826/426                 #    #   #     #       #   #  ##   ##   ###
#                               ####   ###      #      ###  #   #   ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx26o.build.text_section_start=.text=0x200
atx26o.build.millistimer=B1
atx26o.build.bootload=opti
atx26o.build.board=AVR_ATtinyxy6
atx26o.build.clocksource=0
atx26o.build.core=megatinycore
atx26o.build.variant=txy6
atx26o.build.tuned=
atx26o.build.printf=
atx26o.build.wire=MORS
atx26o.build.attachmode=-DCORE_ATTACH_ALL
atx26o.build.mcu=attiny{build.attiny}
atx26o.build.f_cpu={build.speed}000000L
atx26o.build.extra_flags=-DARDUINO_attinyx26 -DUSING_OPTIBOOT {build.tuned}
atx26o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atx26o.bootloader.WDTCFG=0x00
atx26o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx26o.bootloader.OSCCFG=0x01
atx26o.bootloader.TCD0CFG_avrdude=
atx26o.bootloader.TCD0CFG_serialupdi=
atx26o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx26o.bootloader.APPEND=0x00
atx26o.bootloader.BOOTEND=0x02
atx26o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx26o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atx26o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx26o.build.printfabr=
atx26o.build.attachabr=
atx26o.build.wireabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atx26o.upload.workaround=
atx26o.upload.tool=avrdude
atx26o.upload.protocol=arduino
atx26o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atx26o.upload.extra_params=-D -P{serial.port} -b115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 20-pin Optiboot 2-series tinyAVR submenus   #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atx26o.menu.chip.3226=ATtiny3226
atx26o.menu.chip.3226.build.board=AVR_ATtiny3226
atx26o.menu.chip.3226.build.attiny=3226
atx26o.menu.chip.3226.upload.maximum_size=32256
atx26o.menu.chip.3226.upload.maximum_data_size=3072
atx26o.menu.chip.1626=ATtiny1626
atx26o.menu.chip.1626.build.board=AVR_ATtiny1626
atx26o.menu.chip.1626.build.attiny=1626
atx26o.menu.chip.1626.upload.maximum_size=15872
atx26o.menu.chip.1626.upload.maximum_data_size=2048
atx26o.menu.chip.826=ATtiny826
atx26o.menu.chip.826.build.board=AVR_ATtiny826
atx26o.menu.chip.826.build.attiny=826
atx26o.menu.chip.826.upload.maximum_size=7680
atx26o.menu.chip.826.upload.maximum_data_size=1024
atx26o.menu.chip.426=ATtiny426
atx26o.menu.chip.426.build.board=AVR_ATtiny426
atx26o.menu.chip.426.build.attiny=426
atx26o.menu.chip.426.upload.maximum_size=3584
atx26o.menu.chip.426.upload.maximum_data_size=512

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atx26o.menu.clocko.20internal=20 MHz internal
atx26o.menu.clocko.16internal=16 MHz internal
atx26o.menu.clocko.10internal=10 MHz internal
atx26o.menu.clocko.8internal=8 MHz internal
atx26o.menu.clocko.5internal=5 MHz internal
atx26o.menu.clocko.4internal=4 MHz internal
atx26o.menu.clocko.1internal=1 MHz internal
atx26o.menu.clocko.20internaltuned=20 MHz internal - tuned
atx26o.menu.clocko.16internaltuned=16 MHz internal - tuned
atx26o.menu.clocko.12internaltuned=12 MHz internal - tuned
atx26o.menu.clocko.20extclock=20 MHz external clock
atx26o.menu.clocko.16extclock=16 MHz external clock
atx26o.menu.clocko.12extclock=12 MHz external clock
atx26o.menu.clocko.10extclock=10 MHz external clock
atx26o.menu.clocko.8extclock=8 MHz external clock
atx26o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atx26o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atx26o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx26o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx26o.menu.clocko.24extclock=24 MHz external clock - overclocked
atx26o.menu.clocko.25extclock=25 MHz external clock - overclocked
atx26o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atx26o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atx26o.menu.clocko.20internal.build.speed=20
atx26o.menu.clocko.20internal.build.clocksource=0
atx26o.menu.clocko.16internal.build.speed=16
atx26o.menu.clocko.16internal.build.clocksource=0
atx26o.menu.clocko.10internal.build.speed=10
atx26o.menu.clocko.10internal.build.clocksource=0
atx26o.menu.clocko.8internal.build.speed=8
atx26o.menu.clocko.8internal.build.clocksource=0
atx26o.menu.clocko.5internal.build.speed=5
atx26o.menu.clocko.5internal.build.clocksource=0
atx26o.menu.clocko.4internal.build.speed=4
atx26o.menu.clocko.4internal.build.clocksource=0
atx26o.menu.clocko.1internal.build.speed=1
atx26o.menu.clocko.1internal.build.clocksource=0
atx26o.menu.clocko.20extclock.build.speed=20
atx26o.menu.clocko.20extclock.build.clocksource=2
atx26o.menu.clocko.16extclock.build.speed=16
atx26o.menu.clocko.16extclock.build.clocksource=2
atx26o.menu.clocko.12extclock.build.speed=12
atx26o.menu.clocko.12extclock.build.clocksource=2
atx26o.menu.clocko.10extclock.build.speed=10
atx26o.menu.clocko.10extclock.build.clocksource=2
atx26o.menu.clocko.8extclock.build.speed=8
atx26o.menu.clocko.8extclock.build.clocksource=2
atx26o.menu.clocko.24extclock.build.speed=24
atx26o.menu.clocko.24extclock.build.clocksource=2
atx26o.menu.clocko.25extclock.build.speed=24
atx26o.menu.clocko.25extclock.build.clocksource=2
atx26o.menu.clocko.30extclock.build.speed=30
atx26o.menu.clocko.30extclock.build.clocksource=2
atx26o.menu.clocko.32extclock.build.speed=32
atx26o.menu.clocko.32extclock.build.clocksource=2
atx26o.menu.clocko.20internaltuned.build.speed=20
atx26o.menu.clocko.20internaltuned.build.clocksource=0
atx26o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.16internaltuned.build.speed=16
atx26o.menu.clocko.16internaltuned.build.clocksource=0
atx26o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.12internaltuned.build.speed=12
atx26o.menu.clocko.12internaltuned.build.clocksource=0
atx26o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.24internaltuned.build.speed=24
atx26o.menu.clocko.24internaltuned.build.clocksource=0
atx26o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.25internaltuned.build.speed=25
atx26o.menu.clocko.25internaltuned.build.clocksource=0
atx26o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.30internaltuned.build.speed=30
atx26o.menu.clocko.30internaltuned.build.clocksource=0
atx26o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.32internaltuned.build.speed=32
atx26o.menu.clocko.32internaltuned.build.clocksource=0
atx26o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atx26o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atx26o.menu.clocko.5internal.bootloader.OSCCFG=0x02

