SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atx26o.menu.millis.enabled=Enabled (default timer, TCB1)
atx26o.menu.millis.disabled=Disabled (saves flash)
atx26o.menu.millis.timera=TCA0
atx26o.menu.millis.timerb0=TCB0
atx26o.menu.millis.timerb1=TCB1 (default)
atx26o.menu.millis.rtc=RTC (no micros)
atx26o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx26o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx26o.menu.millis.disabled.build.millistimer=NONE
atx26o.menu.millis.timera.build.millistimer=A0
atx26o.menu.millis.timerb0.build.millistimer=B0
atx26o.menu.millis.timerb1.build.millistimer=B1
atx26o.menu.millis.rtc.build.millistimer=RTC
atx26o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx26o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BODVOLTAGE                             #
#________________________________________#
atx26o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx26o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx26o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx26o.menu.bodvoltage.2v1=2.1V (Unofficial)
atx26o.menu.bodvoltage.2v9=2.9V (Unofficial)
atx26o.menu.bodvoltage.3v3=3.3V (Unofficial)
atx26o.menu.bodvoltage.3v7=3.7V (Unofficial)
atx26o.menu.bodvoltage.4v0=4.0V (Unofficial)
atx26o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx26o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atx26o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx26o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx26o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx26o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx26o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx26o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BODMODE                                #
#________________________________________#
atx26o.menu.bodmode.disabled=Disabled/Disabled
atx26o.menu.bodmode.enabled=Enabled/Enabled
atx26o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx26o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx26o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx26o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx26o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx26o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx26o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx26o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx26o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx26o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx26o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx26o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx26o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx26o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx26o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx26o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
atx26o.menu.resetpinopti_2.UPDI=No RST, UPDI enabled, 8 sec Optiboot after power on or SW reset
atx26o.menu.resetpinopti_2.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx26o.menu.resetpinopti_2.UPDI.bootloader.resetpinbits=01
atx26o.menu.resetpinopti_2.UPDIaltrst=UPDI on PA0, RST on PB4 (Optiboot for 1 sec after reset)
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.resetpinbits=11
atx26o.menu.resetpinopti_2.UPDIFastBoot=Optiboot for 1 sec. after power-on & SW reset, no RST pin
atx26o.menu.resetpinopti_2.UPDIFastBoot.bootloader.file=optiboot_tx2z{bootloader.uartswap}_1sec.hex
atx26o.menu.resetpinopti_2.UPDIFastBoot.bootloader.resetpinbits=01
atx26o.menu.resetpinopti_2.reset=RST on PA0, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx26o.menu.resetpinopti_2.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx26o.menu.resetpinopti_2.reset.bootloader.resetpinbits=10
atx26o.menu.resetpinopti_2.gpio=PA0 is GPIO, Optiboot for 8 sec, no RST, no UPDI - *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx26o.menu.resetpinopti_2.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx26o.menu.resetpinopti_2.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx26o.menu.startuptimeopti.8=8ms
atx26o.menu.startuptimeopti.0=0ms
atx26o.menu.startuptimeopti.1=1ms
atx26o.menu.startuptimeopti.2=2ms
atx26o.menu.startuptimeopti.4=4ms
atx26o.menu.startuptimeopti.16=16ms
atx26o.menu.startuptimeopti.32=32ms
atx26o.menu.startuptimeopti.64=64ms
atx26o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx26o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx26o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx26o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx26o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx26o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx26o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx26o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx26o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3) (UART0 default pins)
atx26o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2) (UART0 alt pins)
atx26o.menu.bootloaderuart.alternate1=TX:12 (PC2), RX:11 (PC1) (UART1 alt pins)
atx26o.menu.bootloaderuart.default.bootloader.uartswap=
atx26o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx26o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx26o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx26o.menu.wiremode.mors.build.wire=MORS
atx26o.menu.wiremode.mands=Master and Slave
atx26o.menu.wiremode.mands.build.wire=MANDS

