SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy4o.menu.clocko.20internal=20 MHz internal
atxy4o.menu.clocko.16internal=16 MHz internal
atxy4o.menu.clocko.10internal=10 MHz internal
atxy4o.menu.clocko.8internal=8 MHz internal
atxy4o.menu.clocko.5internal=5 MHz internal
atxy4o.menu.clocko.4internal=4 MHz internal
atxy4o.menu.clocko.1internal=1 MHz internal
atxy4o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy4o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy4o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy4o.menu.clocko.20extclock=20 MHz external clock
atxy4o.menu.clocko.16extclock=16 MHz external clock
atxy4o.menu.clocko.12extclock=12 MHz external clock
atxy4o.menu.clocko.10extclock=10 MHz external clock
atxy4o.menu.clocko.8extclock=8 MHz external clock
atxy4o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy4o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy4o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy4o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy4o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy4o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy4o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy4o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy4o.menu.clocko.20internal.build.speed=20
atxy4o.menu.clocko.20internal.build.clocksource=0
atxy4o.menu.clocko.16internal.build.speed=16
atxy4o.menu.clocko.16internal.build.clocksource=0
atxy4o.menu.clocko.10internal.build.speed=10
atxy4o.menu.clocko.10internal.build.clocksource=0
atxy4o.menu.clocko.8internal.build.speed=8
atxy4o.menu.clocko.8internal.build.clocksource=0
atxy4o.menu.clocko.5internal.build.speed=5
atxy4o.menu.clocko.5internal.build.clocksource=0
atxy4o.menu.clocko.4internal.build.speed=4
atxy4o.menu.clocko.4internal.build.clocksource=0
atxy4o.menu.clocko.1internal.build.speed=1
atxy4o.menu.clocko.1internal.build.clocksource=0
atxy4o.menu.clocko.20extclock.build.speed=20
atxy4o.menu.clocko.20extclock.build.clocksource=2
atxy4o.menu.clocko.16extclock.build.speed=16
atxy4o.menu.clocko.16extclock.build.clocksource=2
atxy4o.menu.clocko.12extclock.build.speed=12
atxy4o.menu.clocko.12extclock.build.clocksource=2
atxy4o.menu.clocko.10extclock.build.speed=10
atxy4o.menu.clocko.10extclock.build.clocksource=2
atxy4o.menu.clocko.8extclock.build.speed=8
atxy4o.menu.clocko.8extclock.build.clocksource=2
atxy4o.menu.clocko.24extclock.build.speed=24
atxy4o.menu.clocko.24extclock.build.clocksource=2
atxy4o.menu.clocko.25extclock.build.speed=24
atxy4o.menu.clocko.25extclock.build.clocksource=2
atxy4o.menu.clocko.30extclock.build.speed=30
atxy4o.menu.clocko.30extclock.build.clocksource=2
atxy4o.menu.clocko.32extclock.build.speed=32
atxy4o.menu.clocko.32extclock.build.clocksource=2
atxy4o.menu.clocko.20internaltuned.build.speed=20
atxy4o.menu.clocko.20internaltuned.build.clocksource=0
atxy4o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.16internaltuned.build.speed=16
atxy4o.menu.clocko.16internaltuned.build.clocksource=0
atxy4o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.12internaltuned.build.speed=12
atxy4o.menu.clocko.12internaltuned.build.clocksource=0
atxy4o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.24internaltuned.build.speed=24
atxy4o.menu.clocko.24internaltuned.build.clocksource=0
atxy4o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.25internaltuned.build.speed=25
atxy4o.menu.clocko.25internaltuned.build.clocksource=0
atxy4o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.30internaltuned.build.speed=30
atxy4o.menu.clocko.30internaltuned.build.clocksource=0
atxy4o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.32internaltuned.build.speed=32
atxy4o.menu.clocko.32internaltuned.build.clocksource=0
atxy4o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.5internal.bootloader.OSCCFG=0x02

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy4o.menu.millis.enabled=Enabled (default timer)
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.timera=TCA0 (default on 0-series)
atxy4o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4o.menu.millis.timerb1=TCB1 (1614 only)
atxy4o.menu.millis.rtc=RTC (no micros)
atxy4o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1-series only, no micros)
atxy4o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1-series only, no micros)
atxy4o.menu.millis.disabled.build.millistimer=NONE
atxy4o.menu.millis.timera.build.millistimer=A0
atxy4o.menu.millis.timerd.build.millistimer=D0
atxy4o.menu.millis.timerb0.build.millistimer=B0
atxy4o.menu.millis.timerb1.build.millistimer=B1
atxy4o.menu.millis.rtc.build.millistimer=RTC
atxy4o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy4o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4o.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy4o.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy4o.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy4o.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy4o.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy4o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy4o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

