SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy4o.menu.bodmode.disabled=Disabled/Disabled
atxy4o.menu.bodmode.enabled=Enabled/Enabled
atxy4o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atxy4o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
atxy4o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
atxy4o.menu.bootloaderuart.default.bootloader.uartswap=
atxy4o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
atxy4o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy4o.menu.resetpinopti.reset.bootloader.file=optiboot_txyz{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy4o.menu.resetpinopti.gpio.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy4o.menu.startuptimeopti.8=8ms
atxy4o.menu.startuptimeopti.0=0ms
atxy4o.menu.startuptimeopti.1=1ms
atxy4o.menu.startuptimeopti.2=2ms
atxy4o.menu.startuptimeopti.4=4ms
atxy4o.menu.startuptimeopti.16=16ms
atxy4o.menu.startuptimeopti.32=32ms
atxy4o.menu.startuptimeopti.64=64ms
atxy4o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy4o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy4o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy4o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy4o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy4o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy4o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy4o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy4o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy4o.menu.wiremode.mors.build.wire=MORS
atxy4o.menu.wiremode.mands=Master and Slave
atxy4o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy4o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy4o.menu.printf.full=Full, 2.6k, prints floats
atxy4o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy4o.menu.printf.full.build.printfabr=.pfF
atxy4o.menu.printf.minimal=Minimal, 1.1k flash used
atxy4o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy4o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy4o.menu.attach.allenabled=On all pins, like usual
atxy4o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy4o.menu.attach.manual=Only enabled ports
atxy4o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy4o.menu.attach.oldversion=Old version, (may fix bugs)
atxy4o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy4o.menu.attach.manual.build.attachabr=.aMan
atxy4o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      #    #  #     ####   ###  #   #    ##   ###
#                               ##    #  #     #   #   #   ##  #    ##   ###
#  ATtiny3224/1624               #    #### ### ####    #   # # #    ##   ###
#  ATtiny824/424                 #       #     #       #   #  ##    ##   ###
#                               ###      #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx24o.build.text_section_start=.text=0x200
atx24o.build.millistimer=B1
atx24o.build.bootload=opti
atx24o.build.board=AVR_ATtinyxy4
atx24o.build.clocksource=0
atx24o.build.core=megatinycore
atx24o.build.variant=txy4
atx24o.build.tuned=
atx24o.build.printf=
atx24o.build.wire=MORS
atx24o.build.attachmode=-DCORE_ATTACH_ALL
atx24o.build.mcu=attiny{build.attiny}
atx24o.build.f_cpu={build.speed}000000L
atx24o.build.extra_flags=-DARDUINO_attinyx24 -DUSING_OPTIBOOT {build.tuned}
atx24o.build.export_merged_output=true

