SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atx24o.menu.millis.enabled=Enabled (default timer, TCB1)
atx24o.menu.millis.disabled=Disabled (saves flash)
atx24o.menu.millis.timera=TCA0
atx24o.menu.millis.timerb0=TCB0
atx24o.menu.millis.timerb1=TCB1 (default)
atx24o.menu.millis.rtc=RTC (no micros)
atx24o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx24o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx24o.menu.millis.disabled.build.millistimer=NONE
atx24o.menu.millis.timera.build.millistimer=A0
atx24o.menu.millis.timerb0.build.millistimer=B0
atx24o.menu.millis.timerb1.build.millistimer=B1
atx24o.menu.millis.rtc.build.millistimer=RTC
atx24o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx24o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BODVOLTAGE                             #
#________________________________________#
atx24o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx24o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx24o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx24o.menu.bodvoltage.2v1=2.1V (Unofficial)
atx24o.menu.bodvoltage.2v9=2.9V (Unofficial)
atx24o.menu.bodvoltage.3v3=3.3V (Unofficial)
atx24o.menu.bodvoltage.3v7=3.7V (Unofficial)
atx24o.menu.bodvoltage.4v0=4.0V (Unofficial)
atx24o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx24o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atx24o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx24o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx24o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx24o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx24o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx24o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BODMODE                                #
#________________________________________#
atx24o.menu.bodmode.disabled=Disabled/Disabled
atx24o.menu.bodmode.enabled=Enabled/Enabled
atx24o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx24o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx24o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx24o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx24o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx24o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx24o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx24o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx24o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx24o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx24o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx24o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx24o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx24o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx24o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx24o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
atx24o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atx24o.menu.resetpinopti.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx24o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atx24o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atx24o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_tx2z{bootloader.uartswap}_1sec.hex
atx24o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atx24o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx24o.menu.resetpinopti.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx24o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atx24o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx24o.menu.resetpinopti.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx24o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx24o.menu.startuptimeopti.8=8ms
atx24o.menu.startuptimeopti.0=0ms
atx24o.menu.startuptimeopti.1=1ms
atx24o.menu.startuptimeopti.2=2ms
atx24o.menu.startuptimeopti.4=4ms
atx24o.menu.startuptimeopti.16=16ms
atx24o.menu.startuptimeopti.32=32ms
atx24o.menu.startuptimeopti.64=64ms
atx24o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx24o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx24o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx24o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx24o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx24o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx24o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx24o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx24o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3) (UART0 default pins)
atx24o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2) (UART0 alt/UART1 default pins)
atx24o.menu.bootloaderuart.default.bootloader.uartswap=
atx24o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx24o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx24o.menu.wiremode.mors.build.wire=MORS
atx24o.menu.wiremode.mands=Master and Slave
atx24o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx24o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx24o.menu.printf.full=Full, 2.6k, prints floats
atx24o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx24o.menu.printf.full.build.printfabr=.pfF
atx24o.menu.printf.minimal=Minimal, 1.1k flash used
atx24o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx24o.menu.printf.minimal.build.printfabr=.pfM

