SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx24o.menu.attach.allenabled=On all pins, like usual
atx24o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx24o.menu.attach.manual=Only enabled ports
atx24o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx24o.menu.attach.oldversion=Old version, (may fix bugs)
atx24o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx24o.menu.attach.manual.build.attachabr=.aMan
atx24o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#                                                                          #
#  WITH OPTIBOOT                      ###      ####   ###  #   #           #
#  ATtiny412                         #   #     #   #   #   ##  #           #
#  ATtiny402                          ###  === ####    #   # # #           #
#  ATtiny212                         #   #     #       #   #  ##           #
#  ATtiny202                          ###      #      ###  #   #           #
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy2o.build.text_section_start=.text=0x200
atxy2o.build.millistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.board=AVR_ATtinyxy2
atxy2o.build.clocksource=0
atxy2o.build.core=megatinycore
atxy2o.build.variant=txy2
atxy2o.build.tuned=
atxy2o.build.printf=
atxy2o.build.wire=MORS
atxy2o.build.attachmode=-DCORE_ATTACH_ALL
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.build.extra_flags=-DARDUINO_attinyxy2 -DUSING_OPTIBOOT {build.tuned}
atxy2o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2o.bootloader.OSCCFG=0x01
atxy2o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02
atxy2o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy2o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy2o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy2o.build.printfabr=
atxy2o.build.attachabr=
atxy2o.build.wireabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy2o.upload.workaround=
atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy2o.upload.extra_params=-D -P{serial.port} -b115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
#  8-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.board=AVR_ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=3584
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.board=AVR_ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=1536
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.board=AVR_ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.millistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=3584
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402.TCD0CFG_avrdude=
atxy2o.menu.chip.402.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.board=AVR_ATtiny402
atxy2o.menu.chip.402w.build.millistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=3584
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402.TCD0CFG_avrdude=
atxy2o.menu.chip.402.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.board=AVR_ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.millistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=1536
atxy2o.menu.chip.202.upload.maximum_data_size=128
atxy2o.menu.chip.202.TCD0CFG_avrdude=
atxy2o.menu.chip.202.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy2o.menu.clocko.20internal=20 MHz internal
atxy2o.menu.clocko.16internal=16 MHz internal
atxy2o.menu.clocko.10internal=10 MHz internal
atxy2o.menu.clocko.8internal=8 MHz internal
atxy2o.menu.clocko.5internal=5 MHz internal
atxy2o.menu.clocko.4internal=4 MHz internal
atxy2o.menu.clocko.1internal=1 MHz internal
atxy2o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy2o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy2o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy2o.menu.clocko.20extclock=20 MHz external clock
atxy2o.menu.clocko.16extclock=16 MHz external clock
atxy2o.menu.clocko.12extclock=12 MHz external clock
atxy2o.menu.clocko.10extclock=10 MHz external clock
atxy2o.menu.clocko.8extclock=8 MHz external clock
atxy2o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy2o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy2o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy2o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy2o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy2o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy2o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy2o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy2o.menu.clocko.20internal.build.speed=20
atxy2o.menu.clocko.20internal.build.clocksource=0
atxy2o.menu.clocko.16internal.build.speed=16
atxy2o.menu.clocko.16internal.build.clocksource=0
atxy2o.menu.clocko.10internal.build.speed=10
atxy2o.menu.clocko.10internal.build.clocksource=0
atxy2o.menu.clocko.8internal.build.speed=8
atxy2o.menu.clocko.8internal.build.clocksource=0
atxy2o.menu.clocko.5internal.build.speed=5
atxy2o.menu.clocko.5internal.build.clocksource=0
atxy2o.menu.clocko.4internal.build.speed=4
atxy2o.menu.clocko.4internal.build.clocksource=0
atxy2o.menu.clocko.1internal.build.speed=1
atxy2o.menu.clocko.1internal.build.clocksource=0
atxy2o.menu.clocko.20extclock.build.speed=20
atxy2o.menu.clocko.20extclock.build.clocksource=2
atxy2o.menu.clocko.16extclock.build.speed=16
atxy2o.menu.clocko.16extclock.build.clocksource=2
atxy2o.menu.clocko.12extclock.build.speed=12
atxy2o.menu.clocko.12extclock.build.clocksource=2
atxy2o.menu.clocko.10extclock.build.speed=10
atxy2o.menu.clocko.10extclock.build.clocksource=2
atxy2o.menu.clocko.8extclock.build.speed=8
atxy2o.menu.clocko.8extclock.build.clocksource=2
atxy2o.menu.clocko.24extclock.build.speed=24
atxy2o.menu.clocko.24extclock.build.clocksource=2
atxy2o.menu.clocko.25extclock.build.speed=24
atxy2o.menu.clocko.25extclock.build.clocksource=2
atxy2o.menu.clocko.30extclock.build.speed=30
atxy2o.menu.clocko.30extclock.build.clocksource=2
atxy2o.menu.clocko.32extclock.build.speed=32
atxy2o.menu.clocko.32extclock.build.clocksource=2
atxy2o.menu.clocko.20internaltuned.build.speed=20
atxy2o.menu.clocko.20internaltuned.build.clocksource=0
atxy2o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.16internaltuned.build.speed=16
atxy2o.menu.clocko.16internaltuned.build.clocksource=0
atxy2o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.12internaltuned.build.speed=12
atxy2o.menu.clocko.12internaltuned.build.clocksource=0
atxy2o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.24internaltuned.build.speed=24
atxy2o.menu.clocko.24internaltuned.build.clocksource=0
atxy2o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.25internaltuned.build.speed=25
atxy2o.menu.clocko.25internaltuned.build.clocksource=0
atxy2o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.30internaltuned.build.speed=30
atxy2o.menu.clocko.30internaltuned.build.clocksource=0
atxy2o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.32internaltuned.build.speed=32
atxy2o.menu.clocko.32internaltuned.build.clocksource=0
atxy2o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.5internal.bootloader.OSCCFG=0x02

