SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy2o.menu.millis.enabled=Enabled (default timer)
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.timera=TCA0 (default on 402/202)
atxy2o.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2o.menu.millis.rtc=RTC (no micros)
atxy2o.menu.millis.disabled.build.millistimer=NONE
atxy2o.menu.millis.timera.build.millistimer=A0
atxy2o.menu.millis.timerd.build.millistimer=D0
atxy2o.menu.millis.timerb0.build.millistimer=B0
atxy2o.menu.millis.rtc.build.millistimer=RTC

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy2o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2o.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy2o.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy2o.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy2o.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy2o.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy2o.menu.bodmode.disabled=Disabled/Disabled
atxy2o.menu.bodmode.enabled=Enabled/Enabled
atxy2o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
# Weird thing - non-alt-0pin bootloaders for 2-series are separate binaries because of LED pin
# But when altgernate pins are used, it can use the same binary as all other 0/1-series!
atxy2o.menu.bootloaderuart.default=TX:0 (PA6), RX:1 (PA7)
atxy2o.menu.bootloaderuart.alternate=TX:2 (PA1), RX:3 (PA2)
atxy2o.menu.bootloaderuart.default.bootloader.uartswap=2
atxy2o.menu.bootloaderuart.alternate.bootloader.uartswap=z_alt

#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
atxy2o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txy{bootloader.uartswap}_1sec.hex
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy2o.menu.resetpinopti.reset.bootloader.file=optiboot_txy{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy2o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy2o.menu.resetpinopti.gpio.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy2o.menu.startuptimeopti.8=8ms
atxy2o.menu.startuptimeopti.0=0ms
atxy2o.menu.startuptimeopti.1=1ms
atxy2o.menu.startuptimeopti.2=2ms
atxy2o.menu.startuptimeopti.4=4ms
atxy2o.menu.startuptimeopti.16=16ms
atxy2o.menu.startuptimeopti.32=32ms
atxy2o.menu.startuptimeopti.64=64ms
atxy2o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy2o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy2o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy2o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy2o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy2o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy2o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy2o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy2o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy2o.menu.wiremode.mors.build.wire=MORS
atxy2o.menu.wiremode.mands=Master and Slave (412 and 212 only)
atxy2o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy2o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy2o.menu.printf.full=Full, 2.6k, prints floats
atxy2o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy2o.menu.printf.full.build.printfabr=.pfF
atxy2o.menu.printf.minimal=Minimal, 1.1k flash used
atxy2o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy2o.menu.printf.minimal.build.printfabr=.pfM

