SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
microchipo.menu.clocko.20internal=20 MHz internal
microchipo.menu.clocko.16internal=16 MHz internal
microchipo.menu.clocko.10internal=10 MHz internal
microchipo.menu.clocko.8internal=8 MHz internal
microchipo.menu.clocko.5internal=5 MHz internal
microchipo.menu.clocko.4internal=4 MHz internal
microchipo.menu.clocko.1internal=1 MHz internal
microchipo.menu.clocko.20internaltuned=20 MHz internal - tuned
microchipo.menu.clocko.16internaltuned=16 MHz internal - tuned
microchipo.menu.clocko.12internaltuned=12 MHz internal - tuned
microchipo.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
microchipo.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
microchipo.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clocko.20internal.build.speed=20
microchipo.menu.clocko.20internal.build.clocksource=0
microchipo.menu.clocko.16internal.build.speed=16
microchipo.menu.clocko.16internal.build.clocksource=0
microchipo.menu.clocko.10internal.build.speed=10
microchipo.menu.clocko.10internal.build.clocksource=0
microchipo.menu.clocko.8internal.build.speed=8
microchipo.menu.clocko.8internal.build.clocksource=0
microchipo.menu.clocko.5internal.build.speed=5
microchipo.menu.clocko.5internal.build.clocksource=0
microchipo.menu.clocko.4internal.build.speed=4
microchipo.menu.clocko.4internal.build.clocksource=0
microchipo.menu.clocko.1internal.build.speed=1
microchipo.menu.clocko.1internal.build.clocksource=0
microchipo.menu.clocko.20internaltuned.build.speed=20
microchipo.menu.clocko.20internaltuned.build.clocksource=0
microchipo.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.16internaltuned.build.speed=16
microchipo.menu.clocko.16internaltuned.build.clocksource=0
microchipo.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.12internaltuned.build.speed=12
microchipo.menu.clocko.12internaltuned.build.clocksource=0
microchipo.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.24internaltuned.build.speed=24
microchipo.menu.clocko.24internaltuned.build.clocksource=0
microchipo.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.25internaltuned.build.speed=25
microchipo.menu.clocko.25internaltuned.build.clocksource=0
microchipo.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.30internaltuned.build.speed=30
microchipo.menu.clocko.30internaltuned.build.clocksource=0
microchipo.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.32internaltuned.build.speed=32
microchipo.menu.clocko.32internaltuned.build.clocksource=0
microchipo.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.20internal.bootloader.OSCCFG=0x02
microchipo.menu.clocko.10internal.bootloader.OSCCFG=0x02
microchipo.menu.clocko.5internal.bootloader.OSCCFG=0x02

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
microchipo.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchipo.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchipo.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchipo.menu.bodvoltage.2v1=2.1V (Unofficial)
microchipo.menu.bodvoltage.2v9=2.9V (Unofficial)
microchipo.menu.bodvoltage.3v3=3.3V (Unofficial)
microchipo.menu.bodvoltage.3v7=3.7V (Unofficial)
microchipo.menu.bodvoltage.4v0=4.0V (Unofficial)
microchipo.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchipo.menu.bodvoltage.2v1.bootloader.bodlevbits=001
microchipo.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchipo.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchipo.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchipo.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchipo.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchipo.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
microchipo.menu.bodmode.disabled=Disabled/Disabled
microchipo.menu.bodmode.enabled=Enabled/Enabled
microchipo.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchipo.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchipo.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchipo.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchipo.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchipo.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchipo.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchipo.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchipo.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchipo.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchipo.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchipo.menu.bodmode.samplefast.bootloader.bodmodebits=01010
microchipo.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
microchipo.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchipo.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchipo.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
microchipo.menu.millis.enabled=Enabled (default timer)
microchipo.menu.millis.disabled=Disabled (saves flash)
microchipo.menu.millis.timera=TCA0 (default on 0-series)
microchipo.menu.millis.timerd=TCD0 (1-series only, default there)
microchipo.menu.millis.timerb0=TCB0 (breaks tone() and Servo except on 1627, 3217)
microchipo.menu.millis.timerb1=TCB1 (3217 and 1627 only, default 2-series)
microchipo.menu.millis.rtc=RTC (no micros)
microchipo.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
microchipo.menu.millis.disabled.build.millistimer=NONE
microchipo.menu.millis.timera.build.millistimer=A0
microchipo.menu.millis.timerd.build.millistimer=D0
microchipo.menu.millis.timerb0.build.millistimer=B0
microchipo.menu.millis.timerb1.build.millistimer=B1
microchipo.menu.millis.rtc.build.millistimer=RTC
microchipo.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
microchipo.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

