SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
microchip.menu.resetpin.UPDI=UPDI (no reset pin)
microchip.menu.resetpin.UPDI.bootloader.resetpinbits=01
microchip.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
microchip.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
# the microchip debuggers are not 12v tolerant so nothing that would need hv programming to reset is supported. And if you cut the straps to debugger, you shouldn't be using this board definition.

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
microchipo.menu.startuptime.8=8ms
microchipo.menu.startuptime.0=0ms
microchipo.menu.startuptime.1=1ms
microchipo.menu.startuptime.2=2ms
microchipo.menu.startuptime.4=4ms
microchipo.menu.startuptime.16=16ms
microchipo.menu.startuptime.32=32ms
microchipo.menu.startuptime.64=64ms
microchipo.menu.startuptime.0.bootloader.SYSCFG1=0x00
microchipo.menu.startuptime.1.bootloader.SYSCFG1=0x01
microchipo.menu.startuptime.2.bootloader.SYSCFG1=0x02
microchipo.menu.startuptime.4.bootloader.SYSCFG1=0x03
microchipo.menu.startuptime.8.bootloader.SYSCFG1=0x04
microchipo.menu.startuptime.16.bootloader.SYSCFG1=0x05
microchipo.menu.startuptime.32.bootloader.SYSCFG1=0x06
microchipo.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
microchipo.menu.wiremode.mors=Master or Slave (saves flash and RAM)
microchipo.menu.wiremode.mors.build.wire=MORS
microchipo.menu.wiremode.mands=Master and Slave
microchipo.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
microchipo.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
microchipo.menu.printf.full=Full, 2.6k, prints floats
microchipo.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
microchipo.menu.printf.full.build.printfabr=.pfF
microchipo.menu.printf.minimal=Minimal, 1.1k flash used
microchipo.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
microchipo.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
microchipo.menu.attach.allenabled=On all pins, like usual
microchipo.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
microchipo.menu.attach.manual=Only enabled ports
microchipo.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
microchipo.menu.attach.oldversion=Old version, (may fix bugs)
microchipo.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
microchipo.menu.attach.manual.build.attachabr=.aMan
microchipo.menu.attach.oldversion.build.attachabr=.aOld
